---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.VelocityPressure
source: html/8a9a9aa8-000c-a7f3-99f8-56a058a7a77d.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.VelocityPressure Property

The velocity pressure of the duct. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double VelocityPressure { get; set; }
```